Revit 2026 API

# AlignmentGetPointAtStation Method

---

Calculates the model point for a given alignment station.

**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetPointAtStation(
	double station
)
```
```vb
Public Function GetPointAtStation (
	station As Double
) As XYZ
```
```cpp
public:
XYZ^ GetPointAtStation(
	double station
)
```
```fsharp
member GetPointAtStation :
        station : float -> XYZ
```

#### Parameters

station Double
    The alignment station for which to calculate the point, in Revit internal model units (standard Imperial feet).

#### Return Value

XYZThe model point at the given alignment station.

#### Reference

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace